itog/src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйКассовыйОрдер</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <basedOn>Document.РеализацияТоваров</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Основание</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

itog/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
  </resources>
</mdclass:AccountingRegister>

itog/src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыНаСкладах</name>
        <description>Товары на складах</description>
        <code>41.01</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
      <childItems>
        <name>КассаОрганизации</name>
        <description>Касса организации</description>
        <code>50.01</code>
      </childItems>
      <childItems>
        <name>КассаОрганизацииВал</name>
        <description>Касса организации (в валюте)</description>
        <code>50.02</code>
      </childItems>
    </items>
    <items>
      <name>РасчетныеСчета</name>
      <description>Расчетные счета</description>
      <code>51</code>
    </items>
    <items>
      <name>ВалютныеСчета</name>
      <description>Валютные счета</description>
      <code>52</code>
    </items>
    <items>
      <name>РасчетыСПоставщикамиИПодрядчиками</name>
      <description>Расчеты с поставщиками и подрядчиками</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПоставщиками</name>
        <description>Расчеты с поставщиками</description>
        <code>60.01</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>РасчетыПоАвансамВыданным</name>
        <description>Расчеты по авансам выданным</description>
        <code>60.02</code>
      </childItems>
    </items>
    <items>
      <name>РасчетыСПокупателямиИЗаказчиками</name>
      <description>Расчеты с покупателями и заказчиками</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПокупателями</name>
        <description>Расчеты с покупателями</description>
        <code>62.01</code>
      </childItems>
      <childItems>
        <name>РасчетыПоАвансамПолученным</name>
        <description>Расчеты по авансам полученным</description>
        <code>62.02</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Выручка</name>
        <description>Выручка</description>
        <code>90.01</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>СебестоимостьПродаж</name>
        <description>Себестоимость продаж</description>
        <code>90.02</code>
      </childItems>
    </items>
  </predefined>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

itog/src/Documents/ПриходныйКассовыйОрдер/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Покупатель;
		Основание = ДанныеЗаполнения.Ссылка;
		Валюта = ДанныеЗаполнения.Валюта;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Покупатель;
		Основание = ДанныеЗаполнения.Ссылка;
		Валюта = ДанныеЗаполнения.Валюта;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)


    // регистр Хозрасчетный 
    Движения.Хозрасчетный.Записывать = Истина;
    Движение = Движения.Хозрасчетный.Добавить();
	
	Если Валюта = ОсновнаяВалюта() Тогда
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.КассаОрганизации;
		Движение.Сумма = СуммаДокумента;
	Иначе
		Движение.СчетДт = ПланыСчетов.Хозрасчетный.КассаОрганизацииВал;
		Движение.ВалютнаяСуммаДт = СуммаДокумента;
		Движение.ВалютаДт = Валюта;
		Движение.Сумма = РаботаСКурсамиВалют.ПересчитатьВВалюту(СуммаДокумента,Валюта,ОсновнаяВалюта(),Дата);
	КонецЕсли;
	
	Движение.ВалютнаяСуммаКт = СуммаДокумента;
    Движение.ВалютаКт = Валюта;
    Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
    Движение.Период = Дата;
    
    Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
	
    //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
    // Данный фрагмент построен конструктором.
    // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

    //}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
